
# 矢量化运算就是 并发式的 同时对所有数据 进行运算 map() apply() applymap()


## Sobject.map(func)   :  Series 的 元素 矢量运算,python自带的

## object.apply(func)  :  DataFrame的 行列 矢量运算,作用在 row 或 columns 进行计算

## 默认是 0 结果apply结果应用在列. axis = 0 结果应用在每一列 axis = 1 结果应用在每一行

## applymap()          :  DataFrame每个元素的 矢量运算

In [7]:
import pandas as pd
import numpy as np
a = pd.Series([9,8,7,6],index=['a','b','c','d'])
b = pd.DataFrame(np.arange(20).reshape(4,5),index=['c','a','d','b'])

In [8]:
def f(x):
    return x+5-2
a.map(f)

a    12
b    11
c    10
d     9
dtype: int64

In [9]:
def func(x):
    if x%5 == 0:
        return x*x
    return x

In [10]:
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [11]:
b.sum(1)

c    10
a    35
d    60
b    85
dtype: int64

In [12]:
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [13]:
b.count(1)

c    5
a    5
d    5
b    5
dtype: int64

In [14]:
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [15]:
b.idxmin()

0    c
1    c
2    c
3    c
4    c
dtype: object

In [16]:
a.idxmin()

'd'

In [17]:
a = pd.DataFrame(np.arange(12).reshape(3,4))

In [18]:
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [19]:
b=pd.DataFrame(np.arange(20).reshape(4,5))

In [20]:
b

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [21]:
a+b

      0     1     2     3   4
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [22]:
a*b

      0     1      2      3   4
0   0.0   1.0    4.0    9.0 NaN
1  20.0  30.0   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN

In [23]:
a+b
#做 +-*/运算时 二视图有 差别,无法做加法,返回NaN

      0     1     2     3   4
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [24]:
print(a)
b

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [25]:
a.add(b,fill_value=1)
#fill_value 替换那些 二者有差别的数据部分,再进行数据运算

      0     1     2     3     4
0   0.0   2.0   4.0   6.0   5.0
1   9.0  11.0  13.0  15.0  10.0
2  18.0  20.0  22.0  24.0  15.0
3  16.0  17.0  18.0  19.0  20.0


# 不同维度的运算 

## DataFrame - Series = 默认是不是用列 去做运算,在这里转换为  : D每行 - S一列

In [26]:
c = pd.Series(np.arange(4))
c

0    0
1    1
2    2
3    3
dtype: int64

In [27]:
c-10
c

0    0
1    1
2    2
3    3
dtype: int64

In [28]:
b

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [29]:
b-c

      0     1     2     3   4
0   0.0   0.0   0.0   0.0 NaN
1   5.0   5.0   5.0   5.0 NaN
2  10.0  10.0  10.0  10.0 NaN
3  15.0  15.0  15.0  15.0 NaN

In [30]:
#切换为 DataFrame的一列 作为一行 - Series
b.sub(c,axis=0)

    0   1   2   3   4
0   0   1   2   3   4
1   4   5   6   7   8
2   8   9  10  11  12
3  12  13  14  15  16


# 比较运算  
---------------

## 比较运算只能比较 _相同索引的元素_ , _不进行补齐(尺寸不同会报错) _

## 二维和一维,一维和零维间 为广播运算

## 采用 < <= > >= == != 等符号进行的二元运算产生布尔值

In [31]:
d = pd.DataFrame(np.arange(12,0,-1).reshape(3,4))

In [32]:
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [33]:
d

    0   1   2  3
0  12  11  10  9
1   8   7   6  5
2   4   3   2  1

In [34]:
d>a

       0      1      2      3
0   True   True   True   True
1   True   True  False  False
2  False  False  False  False

In [35]:
a[d>a]

     0    1    2    3
0  0.0  1.0  2.0  3.0
1  4.0  5.0  NaN  NaN
2  NaN  NaN  NaN  NaN

In [36]:
t = pd.date_range('20200125',periods=10)

In [37]:
t

DatetimeIndex(['2020-01-25', '2020-01-26', '2020-01-27', '2020-01-28',
               '2020-01-29', '2020-01-30', '2020-01-31', '2020-02-01',
               '2020-02-02', '2020-02-03'],
              dtype='datetime64[ns]', freq='D')

In [38]:
s1 = pd.Series([1,3,5,np.nan,6,8,9,10,11,12],index=t)

In [39]:
b.shift(1)

      0     1     2     3     4
0   NaN   NaN   NaN   NaN   NaN
1   0.0   1.0   2.0   3.0   4.0
2   5.0   6.0   7.0   8.0   9.0
3  10.0  11.0  12.0  13.0  14.0


# 累计运算

In [40]:
b

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [54]:
b.cummin() #行累加

   0  1  2  3  4
0  0  1  2  3  4
1  0  1  2  3  4
2  0  1  2  3  4
3  0  1  2  3  4


# 滚动运算

In [42]:
b

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [43]:
#和
b.rolling(2).sum()

      0     1     2     3     4
0   NaN   NaN   NaN   NaN   NaN
1   5.0   7.0   9.0  11.0  13.0
2  15.0  17.0  19.0  21.0  23.0
3  25.0  27.0  29.0  31.0  33.0

In [44]:
#平均数
b.rolling(2).mean()

      0     1     2     3     4
0   NaN   NaN   NaN   NaN   NaN
1   2.5   3.5   4.5   5.5   6.5
2   7.5   8.5   9.5  10.5  11.5
3  12.5  13.5  14.5  15.5  16.5

In [45]:
#方差
b.rolling(2).var()

      0     1     2     3     4
0   NaN   NaN   NaN   NaN   NaN
1  12.5  12.5  12.5  12.5  12.5
2  12.5  12.5  12.5  12.5  12.5
3  12.5  12.5  12.5  12.5  12.5

In [51]:
#标准差
b.rolling(2).std()

          0         1         2         3         4
0       NaN       NaN       NaN       NaN       NaN
1  3.535534  3.535534  3.535534  3.535534  3.535534
2  3.535534  3.535534  3.535534  3.535534  3.535534
3  3.535534  3.535534  3.535534  3.535534  3.535534

In [47]:
#最大最小值
b.rolling(2).min()

      0     1     2     3     4
0   NaN   NaN   NaN   NaN   NaN
1   0.0   1.0   2.0   3.0   4.0
2   5.0   6.0   7.0   8.0   9.0
3  10.0  11.0  12.0  13.0  14.0